# Kaggle y los Retos de Data Science
Actividad Lección 5 || Fundamentos de Big Data

Objetivos:
* Conocer Kaggle como herramienta para practicar nuestros conocimientos en Machine Learning y Data Science

Datos del alumno:
* Víctor Luque Martín
* Máster Avanzado en Programación en Python para Hacking, BigData y Machine Learning

Fecha: 16/07/2022

# Tabla de contenidos
- [1. Entregar el .ipynb del manual](#1-entregar-el-ipynb-del-manual)
    * [1.1. Dependencias](#11-dependencias)
    * [1.2. Obtención de datos](#12-obtencion-de-datos)
    * [1.3. Feature Engineering: Introduccion](#13-feature-engineering-introduccion)
        + [1.3.1. -Name- No la tendremos en cuenta por simplificar](#131-name)
        + [1.3.2. -Age- Usamos el valor promedio de la columna para rellenar los valores faltantes](#132-age)
        + [1.3.3. -Ticket- No la tendremos en cuenta por simplificar](#133-ticket)
        + [1.3.4. -Cabin- No la tendremos en cuenta por falta de información](#134-cabin)
        + [1.3.5. -Embarked- Sustitución de valores nulos por la columna con más valores](#135-embarked)
        + [1.3.6. Eliminación columnas mencionadas](#136-eliminacion)
    * [1.4. Feature Engineering: Datos Categoricos](#14-feature-engineering-datos-categoricos)
    * [1.5. Feature Engineering: Escalado de datos](#15-feature-engineering-escalado-de-datos)
    * [1.6. Obtenemos X,y](#16-x-y)
    * [1.7. Entrenamiento y Prueba](#17-entrenamiento-y-prueba)
    * [1.8. Algoritmos de clasificación](#18-algoritmos-de-clasificacion)
        + [1.8.1. KNeighborsClassifier](#181-kneighborsclassifier)
        + [1.8.2. DecissionTreeClassifier](#182-decissiontreeclassifier)
        + [1.8.3. RandomForestClassifier](#183-randomforestclassifier)
        + [1.8.4. GaussianNB](#184-gaussiannb)
        + [1.8.5. SVC](#185-svc)
        + [1.8.6. Obtengo el que tenga mejor predicción (a priori)](#186-mejor-prediccion)
    * [1.9. Analizo Test.csv](#19-analizo-test-csv)
    * [1.10. Hago en "test" los cambios que hice en "df"](#110-cambios-en-test)
    * [1.11. Prediccion usando Test](#111-prediccion-usando-test)
    * [1.12. Trabajo con Submission.csv](#112-submission-csv)
- [2. Enviar resultados a Kaggle](#2-resultados-a-kaggle)

## 1. Entregar el .ipynb del manual <a class="anchor" id="1-entregar-el-ipynb-del-manual"></a>
Se deberá enviar en un archivo .ipynb la parte del proyecto hecho en clase, (tal cual está).

La idea es ver si se ha trabajado con ello.

### 1.1 Dependecias <a class="anchor" id="11-dependencias"></a>
Dependias principales

In [1]:
import pandas as pd
import numpy as np

Algoritmos de clasificación

In [2]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

Evaluación del modelo

In [3]:
from sklearn.metrics import accuracy_score

Entrenamiento y Prueba

In [4]:
from sklearn.model_selection import train_test_split

### 1.2 Obtención de datos <a class="anchor" id="12-obtencion-de-datos"></a>
Descargar los ficheros [train.csv](https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/train.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1657901995&Signature=jk%2FRL65EPGQj8wLsg2S4yXUMz%2BANkZF1gFoTwzsNcjErxrJq0V0%2BKUVKCirgaU4z0v%2BbjoC1hdNFeb2MgMBQbA9fF5t%2BG1l9vP%2B7PPwoV8mhfpvlnUzcYyZR64uqFoScQ40DJu%2BU7ashiVmvhvJe%2BWmJNWa0H2unKzVN%2FnW%2Fm9M9L572%2FwlbINC9izispI1eYyKUce116m0DZQEwDWPQZi7en5mT9Imucw9Lu%2FUfpc3KG9FEfTeDnuyVLss2ZqIz%2BIMEaxN9aPXXQmM62kPJ31Om9GCQXbvASKnsEisfqiCY%2FYxj%2BaUvqCqocsSQ7EscaJR45g0N5G800yG5ja30Pg%3D%3D&response-content-disposition=attachment%3B+filename%3Dtrain.csv), [test.csv](https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/test.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1657901975&Signature=5LTcoOVzs4yW2hm%2FteQGTmhV1Qzz43twQtxZC0T8F7rB3Lqulw2SjteUcO3cFGT%2Fgowor26rdtkeBg%2FmNpFYJZEyU3soBgJkNEyGWqe3S1PMwbgSeT4N3%2FZD1n30gSg0QlKZir0IXdI9puG7QiIT03hS2GHm7fGkS1LeIm7LSreh1TF98WX%2BbMSt%2FtLzYhXxo1z2xTrnJNlflOXS6QOgWr0VUzqZWasBsyJI2hy5m%2F7z%2Bg5JXnmG4HU7pLHItQR%2BVpi%2FUiZZ5UNfJOm%2BdQNUEwwTO3a6UGlHHv%2F5znyFmEGdLEm53SBr0U4suUzICGgmxxTa3PIX5E46%2FDJlx9iGfQ%3D%3D&response-content-disposition=attachment%3B+filename%3Dtest.csv) y [gender_submission.csv](https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/gender_submission.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1657901943&Signature=QkjL95FRcbSIdv2Mt%2BBUC6MELNwoeTT5MnDJN0SFsb81p%2B36XgZBdXIwIwk6GyVt%2Fum4vbI4vKfeT7QK%2BLXnExxw8iI%2Fqw0OJIq7BL0r4ZOagZoLnoYGDB88xif9sW6chxINfhaoXSS%2FM7mAnnF31kjp2oSEyqT1T%2FV9f9qtvc4TYgUz5HnVuFBZbSIxYl32iBLZa4H08j0YFIftndkrAVMgubPsR5iSkmDr80KBTPD4ICOiEnHOVhO11Lrwz3X899qleDN4XQqXG8ZmNROb2GqLIRHC9PsCyjQ0UlPKXytKXmkMBThRIwEjYL7kAxQfphGF8gN6HsF4EnKlXZvkxw%3D%3D&response-content-disposition=attachment%3B+filename%3Dgender_submission.csv) y ubicarlos en `./resources/titanic`.

Cargar el fichero train.csv con Pandas

In [5]:
df = pd.read_csv('resources/titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1.3 Feature Engineering: Introducción <a class="anchor" id="13-feature-engineering-introduccion"></a>
En esta parte podemos hacer uso de la información obtenida y conclusiones.

Para hacerlo lo más simple posible, lo que haremos será elegir solamente algunas columnas.

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### 1.3.1 -Name- no la tendremos en cuenta por simplificar <a class="anchor" id="131-name"></a>

Una posible forma de analizar la columna Name sería `df["Name"] = df["Name"].str.extract('([A-Za-z]+).', expand=False)`, pero no se tendrá en cuenta.

#### 1.3.2 -Age- Usamos el valor promedio de la columna para rellenar los valores faltantes <a class="anchor" id="132-age"></a>

In [7]:
df.Age.isnull().sum()

177

In [8]:
df.Age = df.Age.fillna(df.Age.mean())

In [9]:
df.Age.isnull().sum()

0

#### 1.3.3 -Ticket- No la tendremos en cuenta por simplificar <a class="anchor" id="133-ticket"></a>

In [10]:
df.Ticket.value_counts()

347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
           ..
9234        1
19988       1
2693        1
PC 17612    1
370376      1
Name: Ticket, Length: 681, dtype: int64

#### 1.3.4 -Cabin- No la tendremos en cuenta por falta de información <a class="anchor" id="134-cabin"></a>

In [11]:
df.Cabin.isnull().sum(), len(df)

(687, 891)

#### 1.3.5 -Embarked- Sustitución de valores nulos por la columna con más valores <a class="anchor" id="135-embarked"></a>

In [12]:
df.Embarked.isnull().sum()

2

In [13]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [14]:
df.Embarked = df.Embarked.fillna('S')
df.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

#### 1.3.6 Eliminación de columnas mencionadas <a class="anchor" id="136-eliminacion"></a>

In [15]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [16]:
df = df.drop(["Name", "Ticket", "Cabin", "PassengerId"], axis=1)
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

Tras obtener el Dataframe(df) los siguientes pasos serán trabajar con las columnas que tienen texto

### 1.4 Feature Engineering: Datos Categóricos <a class="anchor" id="14-feature-engineering-datos-categoricos"></a>

Concepto de **datos categóricos**:
* Columnas con strings hombre/mujer
* Columnas con string con 3 opciones por ejemplo:
    * En el caso de Pclass 3 hace referencia a "tercera clase"
    * y 3 no vale mas que 1, y mas en este caso, cuya probabilidad de supervivencia es más baja.

Utilizamos el método `.get_dummies`, que permite convertir variables categóricas en variables ficticias o indicadoras.

In [17]:
# drop_first=True porque queremos evitar multicolinearidad
df = pd.get_dummies(df, drop_first=True, columns=['Sex', 'Pclass', 'Embarked'])
df.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0,22.0,1,0,7.2500,1,0,1,0,1
1,1,38.0,1,0,71.2833,0,0,0,0,0
2,1,26.0,0,0,7.9250,0,0,1,0,1
3,1,35.0,1,0,53.1000,0,0,0,0,1
4,0,35.0,0,0,8.0500,1,0,1,0,1

### 1.5 Feature Engineering: Escalado de Datos <a class="anchor" id="15-feature-engineering-escalado-de-datos"></a>
Existen varias formas de hacer el escalado de datos. Normalmente no hay diferencias significativas, pero algunas veces si.

Por abreviar, trateremos de mencionar 2 tipos (en Sklearn):
* [StandardScaler](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html)
* [MinMaxScaler](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html)

En nuestro caso no daremos importancia a cuál es el mejor en este caso concreto.

Tampoco usaremos la propia librería, sino la propia ecuación.

Existen varias formas de hacerlo, pero lo haremos de la forma simple antes de dividir en train/test

In [18]:
# StandardScaler
# (x - mean(x)) / std(x)

df.Age = (df.Age - np.mean(df.Age, axis=0)) / (np.std(df.Age, axis=0))
df.Fare = (df.Fare - np.mean(df.Fare, axis=0)) / (np.std(df.Fare, axis=0))
df.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0,-0.592481,1,0,-0.502445,1,0,1,0,1
1,1,0.638789,1,0,0.786845,0,0,0,0,0
2,1,-0.284663,0,0,-0.488854,0,0,1,0,1
3,1,0.407926,1,0,0.420730,0,0,0,0,1
4,0,0.407926,0,0,-0.486337,1,0,1,0,1

### 1.6 Obtenemos X,y <a class="anchor" id="16-x-y"></a>

In [19]:
X = df.drop(['Survived'], axis=1)
X.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,-0.592481,1,0,-0.502445,1,0,1,0,1
1,0.638789,1,0,0.786845,0,0,0,0,0
2,-0.284663,0,0,-0.488854,0,0,1,0,1
3,0.407926,1,0,0.420730,0,0,0,0,1
4,0.407926,0,0,-0.486337,1,0,1,0,1

In [20]:
y = df['Survived']
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

### 1.7 Entrenamiento y Prueba <a class="anchor" id="17-entrenamiento-y-prueba"></a>

In [21]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [22]:
X_train.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
331,1.215947,0,0,-0.074583,1,0,0,0,1
733,-0.515526,0,0,-0.386671,1,1,0,0,1
382,0.177063,0,0,-0.488854,1,0,1,0,1
704,-0.284663,1,0,-0.490280,1,0,1,0,1
813,-1.823750,4,2,-0.018709,0,0,1,0,1

In [23]:
X_test.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
709,0.000000,1,1,-0.341452,1,0,1,0,0
439,0.100109,0,0,-0.437007,1,1,0,0,1
840,-0.746389,0,0,-0.488854,1,0,1,0,1
720,-1.823750,0,1,0.016023,0,1,0,0,1
39,-1.208115,1,0,-0.422074,0,0,1,0,0

In [24]:
y_train.head()

331    0
733    0
382    0
704    0
813    0
Name: Survived, dtype: int64

In [25]:
y_test.head()

709    1
439    0
840    0
720    1
39     1
Name: Survived, dtype: int64

### 1.8 Algoritmos de clasificación <a class="anchor" id="18-algoritmos-de-clasificacion"></a>

#### 1.8.1 KNeighborsClassifier <a class="anchor" id="181-kneighborsclassifier"></a>

In [26]:
clf_knn = KNeighborsClassifier()
clf_knn.fit(X_train, y_train)
y_pred_knn = clf_knn.predict(X_test)
acc_knn = accuracy_score(y_test, y_pred_knn)
acc_knn

0.8212290502793296

#### 1.8.2 DecissionTreeClassifier <a class="anchor" id="182-decissiontreeclassifier"></a>

In [27]:
clf_dt = DecisionTreeClassifier()
clf_dt.fit(X_train, y_train)
y_pred_dt = clf_dt.predict(X_test)
acc_dt = accuracy_score(y_test, y_pred_dt)
acc_dt

0.776536312849162

#### 1.8.3 RandomForestClassifier <a class="anchor" id="183-randomforestclassifier"></a>

In [28]:
clf_rf = RandomForestClassifier()
clf_rf.fit(X_train, y_train)
y_pred_rf = clf_rf.predict(X_test)
acc_rf = accuracy_score(y_test, y_pred_rf)
acc_rf

0.8212290502793296

#### 1.8.4 GaussianNB <a class="anchor" id="184-gaussiannb"></a>

In [29]:
clf_gnb = GaussianNB()
clf_gnb.fit(X_train, y_train)
y_pred_gnb = clf_gnb.predict(X_test)
acc_gnb = accuracy_score(y_test, y_pred_gnb)
acc_gnb

0.7653631284916201

#### 1.8.5 SVC <a class="anchor" id="185-svc"></a>

In [30]:
clf_svc = SVC()
clf_svc.fit(X_train, y_train)
y_pred_svc = clf_svc.predict(X_test)
acc_svc = accuracy_score(y_test, y_pred_svc)
acc_svc

0.8156424581005587

#### 1.8.6 Obtengo el que tenga mejor predicción (a priori) <a class="anchor" id="186-mejor-prediccion"></a>

In [31]:
# KNeighborsClassifier
clf_knn = KNeighborsClassifier()
clf_knn.fit(X_train, y_train)
y_pred_knn = clf_knn.predict(X_test)
acc_knn = accuracy_score(y_test, y_pred_knn)
acc_knn

0.8212290502793296

### 1.9 Analizo Test.csv <a class="anchor" id="19-analizo-test-csv"></a>
**Utilizo ese entrenamiento para test.csv**

Para evitar complejidad, y una posible explicación sobre persistencia del modelo.

https://scikit-learn.org/stable/model_persistence.html

Lo que haremos será hacer esos mismo cambios en test.csv

In [32]:
test = pd.read_csv('resources/titanic/test.csv')
test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [33]:
df_original = pd.read_csv('resources/titanic/train.csv')
df_original.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

**LLAMA LA ATENCIÓN ALGO ¿?**

**Ahora NO TENEMOS la información de "Survived"**

**TENDREMOS, PUES QUE PREDECIRLA**

***
Pasos:
* 1 - Haremos a cada columna exactamente los mismo cambios en "test" que en "df"
* 2 - Haremos la predicción (ahora no sabemos de momento como de buena o mala fue)
* 3 - Nos iremos a Kaggle para enviar resultados

### 1.10 Hago en "test" los cambios que hice en "df" <a class="anchor" id="110-cambios-en-test"></a>

In [34]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [35]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [36]:
test.Age = test.Age.fillna(test.Age.mean())
test.Fare = test.Fare.fillna(test.Fare.mean())

In [37]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [38]:
test = test.drop(["Name", "Ticket", "Cabin"], axis=1)
test.head(2)

   PassengerId  Pclass     Sex   Age  SibSp  Parch    Fare Embarked
0          892       3    male  34.5      0      0  7.8292        Q
1          893       3  female  47.0      1      0  7.0000        S

In [39]:
test.Age = (test.Age - np.mean(test.Age, axis=0)) / (np.std(test.Age, axis=0))
test.Fare = (test.Fare - np.mean(test.Fare, axis=0)) / (np.std(test.Fare, axis=0))
test.head()

   PassengerId  Pclass     Sex       Age  SibSp  Parch      Fare Embarked
0          892       3    male  0.334993      0      0 -0.498407        Q
1          893       3  female  1.325530      1      0 -0.513274        S
2          894       2    male  2.514175      0      0 -0.465088        Q
3          895       3    male -0.259330      0      0 -0.483466        S
4          896       3  female -0.655545      1      1 -0.418471        S

In [40]:
test = pd.get_dummies(test, drop_first=True, columns=['Sex', 'Pclass', 'Embarked'])
test.head()

,PassengerId,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0.334993,0,0,-0.498407,1,0,1,1,0
1,893,1.325530,1,0,-0.513274,0,0,1,0,1
2,894,2.514175,0,0,-0.465088,1,1,0,1,0
3,895,-0.259330,0,0,-0.483466,1,0,1,0,1
4,896,-0.655545,1,1,-0.418471,0,0,1,0,1

In [41]:
test = test.drop("PassengerId", axis=1)
test.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0.334993,0,0,-0.498407,1,0,1,1,0
1,1.325530,1,0,-0.513274,0,0,1,0,1
2,2.514175,0,0,-0.465088,1,1,0,1,0
3,-0.259330,0,0,-0.483466,1,0,1,0,1
4,-0.655545,1,1,-0.418471,0,0,1,0,1

### 1.11 Predicción usando Test <a class="anchor" id="111-prediccion-usando-test"></a>

In [42]:
clf = KNeighborsClassifier()
clf.fit(X_train, y_train)
y_predecida = clf_knn.predict(test)
y_predecida

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

### 1.12 Trabajo con Submission.csv <a class="anchor" id="112-submission-csv"></a>

**Creo un dataframe con la información dentro del csv gender_submission**

In [43]:
df_submission = pd.read_csv('resources/titanic/gender_submission.csv')
df_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

**Ahora sustituyo la columna survived por la información de mi predicción**

In [44]:
df_submission.Survived = y_predecida
df_submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

**Guardamos el dataframe en un csv para subir a Kaggle**

In [45]:
df_submission.to_csv("resources/titanic/titanic.csv", index=False)

# 2. Enviar resultados a Kaggle <a class="anchor" id="2-resultados-a-kaggle"></a>
Tras enviar los resultados a Kaggle, mi puntuación obtenida es de 0,74162, alcanzando la posición 13718 a nivel mundial.

![](img/Titanic%20Ranking%20Victor%20Luque.png)